# Checkpoint Three: Cleaning Data

Now you are ready to clean your data. Before starting coding, provide the link to your dataset below.

My dataset:

Import the necessary libraries and create your dataframe(s).

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

ds_df = pd.read_csv("ds_salaries.csv")


#double check it imported
print(ds_df.info())
# as a side note, it looks like there are no null entries (note for later data cleaning)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB
None

## Missing Data

Test your dataset for missing data and handle it as needed. Make notes in the form of code comments as to your thought process.

In [4]:
for col in ds_df.columns:
    pct_missing = np.mean(ds_df[col].isnull())
    print('{} - {}%'.format(col, round(pct_missing*100)))
# There are no null values in the dataframe from above analysis.

work_year - 0%
experience_level - 0%
employment_type - 0%
job_title - 0%
salary - 0%
salary_currency - 0%
salary_in_usd - 0%
employee_residence - 0%
remote_ratio - 0%
company_location - 0%
company_size - 0%

## Irregular Data

Detect outliers in your dataset and handle them as needed. Use code comments to make notes about your thought process.

In [6]:
ds_df.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [7]:
ds_df['employment_type'].unique()
ds_df.value_counts('employment_type')
#I don't want to count part time work in the analysis, 
#since there is too little data on those type to form meaningful 
#analysis, so I am deleting all of these.

employment_type
FT    3718
PT      17
CT      10
FL      10
dtype: int64

In [8]:

ds_df = ds_df.drop(ds_df[ds_df.employment_type != "FT"].index)
ds_df.value_counts('employment_type')

employment_type
FT    3718
dtype: int64

In [9]:
ds_df.value_counts('employee_residence')
#Countries outside the US or GB do not have enough data to properly analyze, 
#, so I am deleting non-US/GB couunties
#ds_df = ds_df.drop(ds_df[ds_df.employee_residence != 'US'| ds_df.employee_residence !='GB'].index)
ds_df = ds_df[(ds_df.employee_residence == 'GB')  | (ds_df.employee_residence == 'US')]
ds_df.value_counts('employee_residence')

employee_residence
US    2996
GB     167
dtype: int64

In [10]:
ds_df['salary_in_usd'].describe()

#It looks like the maximum salary is quite a bit above average, along
#with the minum salary being quite low. But I think that is fine. I think
#I will keep the high/low values in case there is a reason they are
#high or low.

count      3163.000000
mean     149394.104647
std       56441.347165
min       24000.000000
25%      110000.000000
50%      142200.000000
75%      183405.000000
max      450000.000000
Name: salary_in_usd, dtype: float64

## Unnecessary Data

Look for the different types of unnecessary data in your dataset and address it as needed. Make sure to use code comments to illustrate your thought process.

In [12]:
ds_df=ds_df.drop(['company_size', 'salary',  'salary_currency', 'employment_type'], axis=1)
ds_df.head()
#removed all data that is not relavant anymore now that all 
# non full time employees were removed
# salary not in usd is removed since it is not valuable, along with currency

,work_year,experience_level,job_title,salary_in_usd,employee_residence,remote_ratio,company_location
5,2023,SE,Applied Scientist,222200,US,0,US
6,2023,SE,Applied Scientist,136000,US,0,US
9,2023,SE,Data Scientist,147100,US,0,US
10,2023,SE,Data Scientist,90700,US,0,US
11,2023,SE,Data Analyst,130000,US,100,US

## Inconsistent Data

Check for inconsistent data and address any that arises. As always, use code comments to illustrate your thought process.

In [14]:
ds_df['experience_level'].value_counts()
ds_df['remote_ratio'].value_counts()
# non of the values seems too inconsistant

0      1757
100    1355
50       51
Name: remote_ratio, dtype: int64

## Summarize Your Results

Make note of your answers to the following questions.

1. Did you find all four types of dirty data in your dataset?
2. Did the process of cleaning your data give you new insights into your dataset?
3. Is there anything you would like to make note of when it comes to manipulating the data and making visualizations?

1.No, there were no nun values or inconsistant data in the dataset, although there was irregular and unessary data.
2. Not really, I conducted a thorough analysis in checkpoint 2, and did not learn anything additional
3. I am curious abou the difference in salaries between GB and the US as well as the effect of remote work.